In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [ ]:
#Creating a Dictionary

In [2]:
vehicles = {"Type": ["Car", "Suv", "Truck", "Scooter", "Bike"],
           "Cost" : ["500","600","800","250","75"]}

In [3]:
type(vehicles)

dict

In [8]:
df = pd.DataFrame(vehicles, columns = ["Type", "Cost"])

In [9]:
df

      Type Cost
0      Car  500
1      Suv  600
2    Truck  800
3  Scooter  250
4     Bike   75

In [ ]:
#Flip the DataFrame.(transposition)

In [10]:
df_flip = df.T

In [11]:
df_flip

        0    1      2        3     4
Type  Car  Suv  Truck  Scooter  Bike
Cost  500  600    800      250    75

In [ ]:
#Rename Columns

In [15]:
df_flip = df_flip.rename(columns = {
    df_flip.columns[0]:"Option 1",
    df_flip.columns[1]:"Option 2",
    df_flip.columns[2]:"Option 3",
    df_flip.columns[3]:"Option 4",
    df_flip.columns[4]:"Option 5" 
})

In [16]:
df_flip

     Option 1 Option 2 Option 3 Option 4 Option 5
Type      Car      Suv    Truck  Scooter     Bike
Cost      500      600      800      250       75

In [ ]:
#Cambiando de opinion y presentar el DF en vertical

In [17]:
df_next = df_flip.T

In [19]:
df_next = df_next.reset_index()

In [20]:
df_next

      index     Type Cost
0  Option 1      Car  500
1  Option 2      Suv  600
2  Option 3    Truck  800
3  Option 4  Scooter  250
4  Option 5     Bike   75

In [ ]:
#Cambiando el nombre a la columna index

In [21]:
df_next = df_next.rename(columns = {df_next.columns[0]:"Option"})

In [22]:
df_next

     Option     Type Cost
0  Option 1      Car  500
1  Option 2      Suv  600
2  Option 3    Truck  800
3  Option 4  Scooter  250
4  Option 5     Bike   75

In [ ]:
#Verificando el tipo de objeto para verificar la multiplicacion por columnas

In [24]:
df_next.dtypes

Option    object
Type      object
Cost      object
dtype: object

In [25]:
type(df_next)

pandas.core.frame.DataFrame

In [26]:
df_next #Columna cost esta siendo visualizada como texto y no como objeto

     Option     Type Cost
0  Option 1      Car  500
1  Option 2      Suv  600
2  Option 3    Truck  800
3  Option 4  Scooter  250
4  Option 5     Bike   75

In [27]:
#Fixing de problem
df_next["Cost"] = df_next["Cost"].astype(float)

In [28]:
df_next #miramos que ahora en la columna cost tenemos integer

     Option     Type   Cost
0  Option 1      Car  500.0
1  Option 2      Suv  600.0
2  Option 3    Truck  800.0
3  Option 4  Scooter  250.0
4  Option 5     Bike   75.0

In [29]:
#Adding a Column 25 % Discount on all options
#this means we charge 75% of the original cost!
df_next["Sales Price"] = df_next["Cost"]*0.75

In [30]:
df_next

     Option     Type   Cost  Sales Price
0  Option 1      Car  500.0       375.00
1  Option 2      Suv  600.0       450.00
2  Option 3    Truck  800.0       600.00
3  Option 4  Scooter  250.0       187.50
4  Option 5     Bike   75.0        56.25

In [31]:
#adding more columns
df_next["Diff"] = df_next["Cost"] - df_next["Sales Price"]

In [32]:
df_next

     Option     Type   Cost  Sales Price    Diff
0  Option 1      Car  500.0       375.00  125.00
1  Option 2      Suv  600.0       450.00  150.00
2  Option 3    Truck  800.0       600.00  200.00
3  Option 4  Scooter  250.0       187.50   62.50
4  Option 5     Bike   75.0        56.25   18.75